# 파일 불러오기

In [1]:
import seaborn as sns
import pandas as pd

iris = sns.load_dataset("iris")
result = iris.loc[:, ['sepal_length', 'species']]
result.head(1)

   sepal_length species
0           5.1  setosa

In [3]:
result.to_excel("dataset/iris_excel.xlsx",
                sheet_name='Sheet_name_1',
                index=False)

# Group By 연산 (분석 시 중요!!!!!!!)
- 집계함수와 같이 활용함
- 목적 : 그룹별로 비교하기 위해

In [4]:
import seaborn as sns
tips = sns.load_dataset("tips")
tips.head(3)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

### 문제 1. 성별로 tip 평균 구하기

In [8]:
# 괄호 안에 범주 데이터
tips.groupby('sex', observed=True)['tip'].mean()

# 통계적으로 유의한 결과인가? -> 기초 통계 영역으로 넘어감

sex
Male      3.089618
Female    2.833448
Name: tip, dtype: float64

### 문제 2. 요일별 총 결제 금액 구하기
- 집계함수 : sum()

In [11]:
tips.groupby('day', observed=True)['total_bill'].sum()

day
Thur    1096.33
Fri      325.88
Sat     1778.40
Sun     1627.16
Name: total_bill, dtype: float64

### 문제 3. 요일 & 성별로 팁 평균

In [12]:
tips.groupby(['day', 'sex'], observed=True)['total_bill'].sum()

day   sex
Thur  Male       561.44
      Female     534.89
Fri   Male       198.57
      Female     127.31
Sat   Male      1227.35
      Female     551.05
Sun   Male      1269.46
      Female     357.70
Name: total_bill, dtype: float64

### 문제 4. 식사 시간별 인원 수 평균
- time, size

In [13]:
tips.groupby('time', observed=True)['size'].mean()

time
Lunch     2.411765
Dinner    2.630682
Name: size, dtype: float64

## 2가지 범주 Group By 출력 변환

In [18]:
result = tips.groupby(['day', 'sex'], observed=True)['tip'].mean()
result  # 시리즈

day   sex
Thur  Male      2.980333
      Female    2.575625
Fri   Male      2.693000
      Female    2.781111
Sat   Male      3.083898
      Female    2.801786
Sun   Male      3.220345
      Female    3.367222
Name: tip, dtype: float64

In [20]:
result.unstack()  # 데이터프레임
# 히트맵 시각화로 바로 적용 가능!

sex       Male    Female
day
Thur  2.980333  2.575625
Fri   2.693000  2.781111
Sat   3.083898  2.801786
Sun   3.220345  3.367222

## 집계함수 2개 사용하기
- agg 사용!

In [21]:
tips.groupby(['day', 'sex'], observed=True)['tip'].agg(['sum', 'mean'])

                sum      mean
day  sex
Thur Male     89.41  2.980333
     Female   82.42  2.575625
Fri  Male     26.93  2.693000
     Female   25.03  2.781111
Sat  Male    181.95  3.083898
     Female   78.45  2.801786
Sun  Male    186.78  3.220345
     Female   60.61  3.367222

In [26]:
# 중첩 리스트 형식으로
result = tips.groupby(['day', 'sex'], observed=True)[['tip', 'total_bill']].agg(['sum', 'mean'])
result

                tip           total_bill
                sum      mean        sum       mean
day  sex
Thur Male     89.41  2.980333     561.44  18.714667
     Female   82.42  2.575625     534.89  16.715312
Fri  Male     26.93  2.693000     198.57  19.857000
     Female   25.03  2.781111     127.31  14.145556
Sat  Male    181.95  3.083898    1227.35  20.802542
     Female   78.45  2.801786     551.05  19.680357
Sun  Male    186.78  3.220345    1269.46  21.887241
     Female   60.61  3.367222     357.70  19.872222

In [31]:
# 컬럼이 멀티 인덱스니까 -> 단일 문자열로 변환
result.columns = ['_'.join(col) for col in result.columns]
result.reset_index()

,day,sex,t___i___p_______s___u___m,t___i___p_______m___e___a___n,t___o___t___a___l_______b___i___l___l_______s___u___m,t___o___t___a___l_______b___i___l___l_______m___e___a___n
0,Thur,Male,89.41,2.980333,561.44,18.714667
1,Thur,Female,82.42,2.575625,534.89,16.715312
2,Fri,Male,26.93,2.693000,198.57,19.857000
3,Fri,Female,25.03,2.781111,127.31,14.145556
4,Sat,Male,181.95,3.083898,1227.35,20.802542
5,Sat,Female,78.45,2.801786,551.05,19.680357
6,Sun,Male,186.78,3.220345,1269.46,21.887241
7,Sun,Female,60.61,3.367222,357.70,19.872222

In [29]:
type(result)

pandas.core.frame.DataFrame